-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2023-01-16 21:26:35
-- 伺服器版本： 10.4.25-MariaDB
-- PHP 版本： 8.1.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `opinion`
--

-- --------------------------------------------------------

--
-- 資料表結構 `survey_options_hw`
--

CREATE TABLE `survey_options_hw` (
  `id` int(12) NOT NULL,
  `subject_id` int(12) UNSIGNED NOT NULL,
  `opt` text COLLATE utf8mb4_unicode_520_ci NOT NULL,
  `vote` int(12) UNSIGNED NOT NULL,
  `creaded_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_520_ci;

--
-- 傾印資料表的資料 `survey_options_hw`
--

INSERT INTO `survey_options_hw` (`id`, `subject_id`, `opt`, `vote`, `creaded_at`, `updated_at`) VALUES
(1, 1, '企鵝', 3, '2023-01-08 14:47:42', '2023-01-12 13:06:04'),
(2, 1, '北極熊', 18, '2023-01-08 14:47:42', '2023-01-12 13:06:04'),
(3, 4, '萌萌小天使', 812, '2023-01-08 14:59:40', '2023-01-16 17:25:45'),
(4, 4, '家人', 41, '2023-01-08 14:59:40', '2023-01-16 17:24:26'),
(5, 1, '海洋生物', 7, '2023-01-12 13:01:51', '2023-01-12 13:06:04'),
(6, 1, '其它', 0, '2023-01-12 13:01:51', '2023-01-12 13:06:04'),
(7, 5, '先隨便選', 2, '2023-01-12 15:20:32', '2023-01-12 15:20:32'),
(8, 5, '看看結果', 2, '2023-01-12 15:20:32', '2023-01-12 15:20:32'),
(9, 6, '世外桃源', 16, '2023-01-14 03:37:40', '2023-01-16 19:43:45'),
(10, 6, '好山好水', 22, '2023-01-14 03:38:19', '2023-01-16 19:43:51'),
(11, 6, '天使眼淚', 94, '2023-01-14 03:38:19', '2023-01-16 19:44:01'),
(13, 7, '溫暖', 8, '2023-01-14 03:40:45', '2023-01-16 17:17:12'),
(14, 7, '剛下完大雨', 5, '2023-01-14 03:40:45', '2023-01-16 17:17:28'),
(15, 7, '就是那道光 ?', 3, '2023-01-14 03:40:45', '2023-01-16 17:17:33'),
(17, 8, '不知道', 44, '2023-01-14 03:41:15', '2023-01-16 19:45:31'),
(18, 8, '夢裡', 24, '2023-01-14 03:41:15', '2023-01-16 19:45:46'),
(19, 9, 'PHP', 120, '2023-01-14 03:42:15', '2023-01-16 19:48:19'),
(20, 9, 'Javascript', 20, '2023-01-14 03:42:15', '2023-01-16 19:48:25'),
(21, 9, 'Python', 100, '2023-01-14 03:42:15', '2023-01-16 19:48:31'),
(24, 11, '想飛', 104, '2023-01-15 01:35:48', '2023-01-16 17:18:24'),
(25, 11, '很冷', 12, '2023-01-15 01:35:48', '2023-01-16 17:18:45'),
(26, 11, '清新的空氣', 84, '2023-01-15 01:35:48', '2023-01-16 17:18:41'),
(31, 26, '民眾黨', 280, '2023-01-15 15:40:33', '2023-01-16 19:56:57'),
(36, 5, '220有問題', 0, '2023-01-15 16:29:10', '2023-01-15 16:29:10'),
(39, 4, '滿滿幸福感', 174, '2023-01-16 16:07:32', '2023-01-16 17:24:10'),
(40, 8, '這我家', 134, '2023-01-16 16:13:26', '2023-01-16 19:47:03'),
(41, 9, '都喜歡 !!', 40, '2023-01-16 16:16:21', '2023-01-16 19:50:58'),
(42, 26, '國民黨', 180, '2023-01-16 16:20:21', '2023-01-16 19:57:13'),
(43, 26, '時代力量', 100, '2023-01-16 16:20:21', '2023-01-16 19:57:33'),
(44, 34, '拿槍的人', 10, '2023-01-16 16:46:43', '2023-01-16 19:50:14'),
(45, 34, '怪怪的安全帽', 20, '2023-01-16 16:46:43', '2023-01-16 19:49:54'),
(46, 34, '有披風', 2, '2023-01-16 16:46:43', '2023-01-16 19:50:18'),
(47, 34, '機器人', 88, '2023-01-16 16:46:43', '2023-01-16 19:50:02'),
(48, 51, '正義', 11, '2023-01-16 16:57:18', '2023-01-16 17:19:30'),
(49, 51, '邪惡', 46, '2023-01-16 16:57:18', '2023-01-16 17:19:38'),
(50, 51, '第三方', 23, '2023-01-16 16:57:18', '2023-01-16 17:19:54'),
(60, 26, '民進黨', 220, '2023-01-16 19:53:15', '2023-01-16 19:57:27'),
(61, 26, '其他', 100, '2023-01-16 19:53:15', '2023-01-16 19:54:54');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `survey_options_hw`
--
ALTER TABLE `survey_options_hw`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `survey_options_hw`
--
ALTER TABLE `survey_options_hw`
  MODIFY `id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
